-- Вставка данных в таблицу STATUS
INSERT INTO dbo.STATUS (NAME) VALUES ('Работает'), ('Уволен'), ('В отпуске');

-- Вставка данных в таблицу deps (отделы)
INSERT INTO dbo.deps (NAME) VALUES ('Отдел продаж'), ('Бухгалтерия'), ('Отдел разработки');

-- Вставка данных в таблицу posts (должности)
INSERT INTO dbo.posts (NAME) VALUES ('Менеджер'), ('Бухгалтер'), ('Разработчик');


-- Вставка данных в таблицу persons
INSERT INTO dbo.persons (first_name, second_name, last_name, date_employ, date_uneploy, STATUS, id_dep, id_post)
VALUES 
    ('Иван', 'Иванович', 'Иванов', CONVERT(DATETIME, '2020-01-15', 120), NULL, 1, 1, 1),
    ('Петр', 'Петрович', 'Петров', CONVERT(DATETIME, '2019-03-22', 120), NULL, 1, 2, 2),
    ('Сергей', 'Сергеевич', 'Сергеев', CONVERT(DATETIME, '2018-07-11', 120), NULL, 1, 3, 3),
    ('Алексей', 'Алексеевич', 'Алексеев', CONVERT(DATETIME, '2021-09-30', 120), NULL, 1, 1, 3),
    ('Андрей', 'Андреевич', 'Андреев', CONVERT(DATETIME, '2017-12-01', 120), CONVERT(DATETIME, '2023-05-20', 120), 0, 2, 1),
    ('Максим', 'Максимович', 'Максимов', CONVERT(DATETIME, '2022-05-15', 120), NULL, 1, 3, 2),
    ('Николай', 'Николаевич', 'Николаев', CONVERT(DATETIME, '2020-10-10', 120), NULL, 1, 1, 2),
    ('Дмитрий', 'Дмитриевич', 'Дмитриев', CONVERT(DATETIME, '2016-04-05', 120), CONVERT(DATETIME, '2022-08-10', 120), 0, 2, 3),
    ('Владимир', 'Владимирович', 'Владимиров', CONVERT(DATETIME, '2019-11-19', 120), NULL, 1, 3, 1),
    ('Александр', 'Александрович', 'Александров', CONVERT(DATETIME, '2021-06-25', 120), NULL, 1, 1, 1),
    ('Юрий', 'Юрьевич', 'Юрьев', CONVERT(DATETIME, '2018-03-15', 120), NULL, 1, 2, 2),
    ('Евгений', 'Евгеньевич', 'Евгеньев', CONVERT(DATETIME, '2020-07-13', 120), NULL, 1, 3, 3),
    ('Виктор', 'Викторович', 'Викторов', CONVERT(DATETIME, '2019-02-14', 120), NULL, 1, 1, 3),
    ('Роман', 'Романович', 'Романов', CONVERT(DATETIME, '2021-08-23', 120), NULL, 1, 2, 1),
    ('Антон', 'Антонович', 'Антонов', CONVERT(DATETIME, '2017-11-18', 120), CONVERT(DATETIME, '2023-03-11', 120), 0, 3, 2),
    ('Артур', 'Артурович', 'Артуров', CONVERT(DATETIME, '2022-02-21', 120), NULL, 1, 1, 2),
    ('Григорий', 'Григорьевич', 'Григорьев', CONVERT(DATETIME, '2020-09-09', 120), NULL, 1, 2, 3),
    ('Михаил', 'Михайлович', 'Михайлов', CONVERT(DATETIME, '2019-06-10', 120), NULL, 1, 3, 1),
    ('Валерий', 'Валерьевич', 'Валерьев', CONVERT(DATETIME, '2018-01-05', 120), NULL, 1, 1, 1),
    ('Игорь', 'Игоревич', 'Игорев', CONVERT(DATETIME, '2021-04-12', 120), NULL, 1, 2, 2),
    ('Олег', 'Олегович', 'Олегов', CONVERT(DATETIME, '2019-05-12', 120), NULL, 1, 1, 1),
    ('Леонид', 'Леонидович', 'Леонидов', CONVERT(DATETIME, '2018-06-24', 120), NULL, 1, 2, 2),
    ('Федор', 'Федорович', 'Федоров', CONVERT(DATETIME, '2017-08-30', 120), NULL, 1, 3, 3),
    ('Кирилл', 'Кириллович', 'Кириллов', CONVERT(DATETIME, '2020-11-05', 120), NULL, 1, 1, 3),
    ('Аркадий', 'Аркадьевич', 'Аркадьев', CONVERT(DATETIME, '2019-05-01', 120), CONVERT(DATETIME, '2022-05-31', 120), 0, 1, 1),
    ('Валентин', 'Валентинович', 'Валентинов', CONVERT(DATETIME, '2020-02-15', 120), CONVERT(DATETIME, '2023-02-28', 120), 0, 2, 2),
    ('Даниил', 'Даниилович', 'Даниилов', CONVERT(DATETIME, '2018-08-10', 120), CONVERT(DATETIME, '2022-08-31', 120), 0, 3, 3),
    ('Егор', 'Егорович', 'Егоров', CONVERT(DATETIME, '2017-06-25', 120), CONVERT(DATETIME, '2021-06-30', 120), 0, 1, 3),
    ('Захар', 'Захарович', 'Захаров', CONVERT(DATETIME, '2021-01-10', 120), CONVERT(DATETIME, '2024-01-31', 120), 0, 2, 1),
    ('Илья', 'Ильич', 'Ильин', CONVERT(DATETIME, '2019-07-15', 120), CONVERT(DATETIME, '2022-07-31', 120), 0, 3, 2),
    ('Константин', 'Константинович', 'Константинов', CONVERT(DATETIME, '2018-03-20', 120), CONVERT(DATETIME, '2022-03-31', 120), 0, 1, 1),
    ('Лев', 'Львович', 'Львов', CONVERT(DATETIME, '2020-04-05', 120), CONVERT(DATETIME, '2023-04-30', 120), 0, 2, 2),
    ('Михаил', 'Михайлович', 'Михайлов', CONVERT(DATETIME, '2017-09-10', 120), CONVERT(DATETIME, '2021-09-30', 120), 0, 3, 3),
    ('Никита', 'Никитович', 'Никитов', CONVERT(DATETIME, '2019-02-20', 120), CONVERT(DATETIME, '2022-02-28', 120), 0, 1, 3),
    ('Алексей', 'Алексеевич', 'Алексеев', CONVERT(DATETIME, '2020-01-15', 120), NULL, 1, 1, 1),
    ('Борис', 'Борисович', 'Борисов', CONVERT(DATETIME, '2019-03-22', 120), NULL, 1, 2, 2),
    ('Владимир', 'Владимирович', 'Владимиров', CONVERT(DATETIME, '2018-07-11', 120), NULL, 1, 3, 3),
    ('Геннадий', 'Геннадьевич', 'Геннадьев', CONVERT(DATETIME, '2021-09-30', 120), NULL, 1, 1, 3),
    ('Дмитрий', 'Дмитриевич', 'Дмитриев', CONVERT(DATETIME, '2017-12-01', 120), NULL, 1, 2, 1),
    ('Евгений', 'Евгеньевич', 'Евгеньев', CONVERT(DATETIME, '2022-05-15', 120), NULL, 1, 3, 2),
    ('Жорж', 'Жоржевич', 'Жоржев', CONVERT(DATETIME, '2020-10-10', 120), NULL, 1, 1, 2),
    ('Захар', 'Захарович', 'Захаров', CONVERT(DATETIME, '2016-04-05', 120), NULL, 1, 2, 3),
    ('Иван', 'Иванович', 'Иванов', CONVERT(DATETIME, '2019-11-19', 120), NULL, 1, 3, 1),
    ('Константин', 'Константинович', 'Константинов', CONVERT(DATETIME, '2021-06-25', 120), NULL, 1, 1, 1),
    ('Леонид', 'Леонидович', 'Леонидов', CONVERT(DATETIME, '2018-03-15', 120), NULL, 1, 2, 2),
    ('Максим', 'Максимович', 'Максимов', CONVERT(DATETIME, '2020-07-13', 120), NULL, 1, 3, 3),
    ('Никита', 'Никитич', 'Никитов', CONVERT(DATETIME, '2019-02-14', 120), NULL, 1, 1, 3),
    ('Олег', 'Олегович', 'Олегов', CONVERT(DATETIME, '2021-08-23', 120), NULL, 1, 2, 1),
    ('Павел', 'Павлович', 'Павлов', CONVERT(DATETIME, '2017-11-18', 120), NULL, 1, 3, 2);
